<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="utf-8">
		<meta http-equiv="X-UA-Compatible" content="IE=edge">
		<meta name="description" content="Это личный тренировочный сайт, созданный для обучения. На нём я учусь правильно программировать, наполнять сайт контентом и оформлять его.">
		<meta name="keywords" content="Обучение, тестирование, программирование, развитие, сайт, планы">
		<meta name="viewport" content="width=device-width, initial-scale=1.0 shrink-to-fit=no">
		<meta name="robots" content="index, follow">
		<meta name="googlebot" content="index, follow">
		<meta name="slurp" content="index, follow">
		<meta name="author" content="Иван Тарарин">
		<meta name="creator" content="Иван Тарарин">
		<meta name="publisher" content="Иван Тарарин">

	<title>Личный сайт Скалера</title>
	
	<link rel="stylesheet" href="/styles/normalize.css"> 
	<link rel="stylesheet" href="/styles/all_style.css">
	<link rel="stylesheet" href="test.css">		
		<link rel="preconnect" href="https://fonts.googleapis.com">
		<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
		<link href="https://fonts.googleapis.com/css2?family=Rubik+Beastly&display=swap" rel="stylesheet">
</head>
<body>

	<header>
		<?php 
			include "menu.html"; 
		?>
	</header>

	<main>
		
		<h1 class="websiteName">
			Личный сайт Скалера
		</h1>

		<p>Тестовое изменение</p>
		  

		<img src="/img/scaler.jpg" alt="Скалер в прыжке" class="image_index" width="430" height="380"> 

		<p>Перед Вами <strong>тестовый сайт для проверки навыков</strong>. На нём я <strong>учусь правильно программировать</strong>, наполнять сайт контентом и оформлять его (И да, мне нравятся фиолетовый и зелёный, любимые цвета!).</p> 
		<p>Изначально сайт и все программы на нём я создал благодаря обучению на бесплатном курсе портала <dfn title="GeekBrains - онлайн-портал платного обучения"><a href="https://gb.ru/" target="_blank" rel="noopener noreferrer">Гикбрейнс</a></dfn>, а так же в иных источниках (в основном самообучение по открытым источникам информации).</p>
		<p>Так же <em>крайне</em> рекомендую <a href="https://t.me/pereiti_v_aiti" target="_blank" rel="noopener noreferrer">чат в <img src="img/tg_icon.jpg" alt="Иконка Телеграмма" height="20">Телеграме</a>, где начинашкам в очень приятной <s>но не слишком аморфной</s> атмосфере помогают стать разработчиком.
		Там есть такие же новички, а есть сеньоры кодинга, а ещё шутки, поддержка и ответы на любые вопросы.</p>
		
		<h2 class="strong_underline">Содержание сайта:</h2>
			<p>На сайте можно сыграть в несколько игр, или воспользоваться небольшими программами, которые я написал <strong>по инструкции курса <abbr title="Сокращение от GeekBrains - тот самый портал">GB</abbr></strong>. 
			К сожалению, курса на портале уже нет, но наверняка есть что-то подобное.</p>
			<p>Так же на сайте есть страница с рекламной информацией по работе студии "Вариант" (дизайн и оформление интерьера), один из управляющих владельцев - моя мама. Эта студия - опытный эксперт в своей сфере, и может предложить качество высочайшего уровня.</p>
			<p>Обратите внимание, что на сайте присутствует тестовая страница. Она не предназначена для пользования и служит инструментом для проверки работоспособности новых страниц сайта. Однако на ней можно увидеть текущие разработки.</p>
		<section>
			<h2 class="h2_new">Обновления сайта</h2>				
				<table>				
				<caption>Последние обновления</caption>				
				<tr><th scope="col">Дата обновления</th><th scope="col">Что изменилось</th></tr>					
				<tr><td><time datetime="2023-07-26">24.07.23</time></td><td>Прокрутка страниц загадок и дизайна - переходы по разделам при помощи навигации теперь плавные.</td></tr>
				<tr><td><time datetime="2023-07-26">26.07.23</time></td><td>Название сайта стилистически изменено.</td></tr>
				<tr><td><time datetime="2023-08-31">31.08.23</time></td><td>Список обновлений на сайте переоформлен. Изменена картинка на странице "Запомни числа". Там же и на "Генераторе паролей" добавлен знак предупреждения.</td></tr>
				<tr><td><time datetime="2023-10-06">06.10.23</time></td><td>На страницах "Слепой печати", "Генераторе пароля" и "Запомни числа" к значку предупреждения добавлена анимация.</td></tr>
				<tr><td><time datetime="2023-10-22">22.10.23</time></td><td>Изменён базовый шрифт сайта.</td></tr>
				<tr><td><time datetime="2023-10-22">15.12.23</time></td><td>Обновления теперь фиксируются в таблице.</td></tr>					
				</table>
				<hr>	
			<h3>Что нужно будет добавить/доработать в будущем:</h3>
				<ol class="will_be">						
					<li>Оформить красиво все страницы:
						<ol type="a"> 
							<li><s>Подобрать цветовую гамму</s>, шрифты, убрать все ошибки в стилистике, во всех названиях/заголовках/подзаголовках убрать точки. Затем попросить Веру проверить.</li>
							<li>Везде расположить картинки/игры/программы по центру. Подумать, где вводить данные в середине инпутов, а где - слева (текст и большие числа/числа?)</li>
							<li>Выровнять заголовки, сдвинутые с центра из-за обтекания картинок на главной.</li>
							<li>Ссылки в футере заменить маленькими картинками (мыло и ВК - сделать ссылку на страницу, сделать ВК объявление и в контактные данные сайт внести)</li>
							<li>Создать favicon для сайта и разместить его.</li>
						</ol>
					</li>	
					<li>Сделать логотип сайта над меню с ссылкой на главную, обернуть в нав, убрать главную из меню.</li>
					<li>Сделать баннер для сайта.</li>
					<li>Тесты (делай с помощью инпутов, тайпов радио и лейблов) по Лиге - найди своего мейна (сперва тестовый и согласование с Рито) и кто ты из Лиги (сперва тестовый и согласование с Рито)</li>
					<li>Переработать загадки - сделать у каждой загадки свой ввод ответа с кнопкой, убрать счётчик и отвечать на каждую по отдельности. Так же при верном ответе загадка исчезает.</li>
					<li>Поставить ограничение символов по ширине экрана на генератор паролей</li>
					<li>Создать для сайта карточку для мессенджеров</li>
					<li>Сделать более быструю загрузку страницы по дизайну. Переработка - сделать сами презентации на странице при помощи фреймов или слайдеров.</li>
					<li>Сделать второй сайт по программе wordрress (?), соединить с этим, продублировать статью с обзором работ мамы и Лёши, далее превратить в отдельный сайт.</li>
					<li>Сделать после всего поле с комментариями по сайту - "Гостевую книгу" (как???) и страницу для недовольных.</li>
					<li>Сделать адаптивную версию сайта.</li>
					<li>Провести полную SEO-работу над сайтом.</li>
				</ol>
				<p>Ого,  Вы дочитали аж до сюда... Большое спасибо, это важно для меня. Оставьте мне отзыв о сайте, или, если Вам интересно, я могу уведомлять Вас об обновлениях на сайте.</p>
		</section>
		<img src="/img/main.jpg" alt="Обложка Скалера" class="image_index_2" height="337"> 
		<h2>Об авторе</h2>
			<p>Я родился 09.02.1996 в Санкт-Петербурге. Взросление прошло в Зеленограде, небольшом прекрасном городке недалеко от Москвы. Сейчас я вернулся в Питер.</p>
			<p>Увлекаюсь видеоиграми, читаю. В детстве моей первой и любимой видеоигрой стала игра Scaler. Картинки, связанные с игрой, можно найти на этом сайте, а ещё обычно я везде называюсь таким ником.
				Я хотел создать по ней сайт, но такой достойный сайт уже есть - <a href="https://scaler.fandom.com/wiki/Scaler_Wiki" rel="noopener noreferrer" target="_blank">вот</a>. 
				Возможно, когда-нибудь я вернусь к этой игре и помогу с редактированием этого сайта.</p>
			<p>В какой-то мере знаю английский язык. Раньше немного играл в баскетбол, играл в театре, занимался психологией.</p>
			<p>Имею небольшой опыт работы в гостинице, большой - телефонным оператором в медицинской клинике, вплоть до руководящей позиции.</p>
			<p><a href = "https://proza.ru/avtor/scaler158"  rel="noopener noreferrer" target="_blank">Тут</a> можно почитать прозу, которую я сочинил и написал, а <a href = "https://stihi.ru/avtor/scaler158"  rel="noopener noreferrer" target="_blank">тут</a> - стихи моего сочинения.</p>
			
		<address>Моя почта - <a href="mailto:tararin.ivan@mail.ru?subject=Письмо_с_сайта">tararin.ivan@mail.ru</a></address>
	</main>

	
	<footer>
		<?php
		include "footer.html";
		?>
	</footer>	
	
</body>
</html>